{
	"app_name": "Trouve ta voie",
	"header": {
		"nav_items": {
			"home": "Accueil",
			"climbs": "Grimpes"
		},
		"search_placeholder": "Recherche"
	},
	"auth": {
		"title": "Authentification",
		"login_tab": "Connexion",
		"register_tab": "Créer un compte",
		"sign_out": "Déconnexion"
	},
	"account": {
		"profile": "Profil utilisateur",
		"created_places": "Vos lieux",
		"created_climbs": "Vos grimpes",
		"rated_climbs": "Vos grimpes notées"
	},
	"create": {
		"place": "Créer un lieu",
		"climb": "Créer une grimpe"
	},
	"update": {
		"place": "Modifier le lieu",
		"climb": "Modifier la grimpe"
	},
	"delete": {
		"place": {
			"title": "Supprimer le lieu",
			"confirm_message": "Voulez-vous vraiment supprimer le lieu suivant : '{placeTitle}'"
		},
		"climb": {
			"title": "Supprimer la grimpe",
			"confirm_message": "Voulez-vous vraiment supprimer la grimpe suivante : '{climbTitle}' ?"
		}
	},
	"home": {
		"most_popular_climbs": "Grimpes les plus populaires"
	},
	"details": {
		"place": {
			"details": "Détails du lieu",
			"climbs": "Grimpe(s) du lieu",
			"climbs_list": "Liste des grimpes"
		},
		"climb": {
			"details": "Détails de la grimpe",
			"rate": "Noter la grimpe"
		}
	},
	"buttons": {
		"sign_in": "S'identifier",
		"register": "S'inscrire",
		"create": "Créer",
		"save_changes": "Enregistrer les modifications",
		"delete": "Supprimer",
		"filter": "Appliquer le filtre",
		"load_more": "Charger plus de résultats",
		"cancel": "Annuler",
		"confirm": "Confirmer"
	},
	"links": {
		"see_more": {
			"climb": {
				"popular": "Voir plus de grimples populaires >",
				"all": "Voir toutes les grimpes >"
			},
			"profile": "Voir mon profil"
		},
		"create": "Créer",
		"modify": "Modifier",
		"delete": "Supprimer"
	},
	"fields": {
		"username": "Nom d'utilisateur",
		"email": "Courriel",
		"password": "Mot de passe",
		"confirm_password": "Confirmation du mot de passe",
		"title": "Titre",
		"description": "Description",
		"steps": "Directives",
		"latitude": "Latitude",
		"longitude": "Longitude",
		"style": "Choisir un style",
		"difficulty_level": "Niveau de difficulté",
		"place_title": "Choisir un lieu",
		"images": "Sélectionner une image"
	},
	"empty_result": {
		"place": {
			"climb": {
				"style": "Il n'y a pas de grimpe pour ce style",
				"difficulty_level": "Il n'y a pas de grimpe pour ce niveau de difficulté",
				"none": "Il n'y a pas de grimpe pour ce lieu"
			}
		},
		"climb": {
			"none": "Il n'y a pas de grimpe à afficher"
		}
	},
	"successes": {
		"routes": {
			"register": "Succès de la création du compte utilisateur!",
			"login": "Succès de la connexion!",
			"sign_out": "Succès de la déconnexion! Au revoir",
			"create": {
				"place": "Le lieu a été créé avec succès!",
				"climb": "La grimpe a été créé avec succès!",
				"rate": {
					"climb": "La note a été ajouté à la grimpe!"
				}
			},
			"update": {
				"account_profile": "Les modifications effectuées au profil utilisateur ont été enregistrées avec succès!",
				"place": "Les modifications du lieu ont été enregistrées avec succès!",
				"climb": "Les modifications de la grimpe ont été enregistrées avec succès!",
				"rate": {
					"climb": "La note de la grimpe a été modifiée!"
				}
			},
			"delete": {
				"place": "La place a été supprimé avec succès!",
				"climb": "La grimpe a été supprimé avec succès!",
				"rate": {
					"climb": "La note a été retirée de la grimpe!"
				}
			}
		}
	},
	"warnings": {
		"auth": {
			"login_again": "Votre session a expiré. Vous avez été déconnecté du site"
		}
	},
	"errors": {
		"404": "OUPS ! La page à laquelle vous avez essayé d'accéder est introuvable!",
		"auth": {
			"login_required": "Il faut d'abord vous connecter pour pouvoir accéder à cette page",
			"session_expired": "Votre session est expirée. S'il vous plaît vous reconnecter",
			"unauthorized": "Non autorisé {'|'} Vous n'avez pas les accès nécessaires pour accéder à cette page"
		},
		"fields": {
			"user": {
				"username": {
					"is_null": "Le nom d'utilisateur ne peut être vide",
					"empty_or_white_spaces": "Le nom d'utilisateur ne peut être vide ou composé uniquement d'espace blancs",
					"length": "Le nom d'utilisateur doit contenir entre 3 et 50 caractères"
				},
				"email": {
					"already_taken": "Le courriel saisi est déjà associé à un compte utilisateur",
					"not_found": "Le courriel saisi est introuvable",
					"is_null": "Le courriel ne peut être vide",
					"empty_or_white_spaces": "Le courriel ne peut être vide ou composé uniquement d'espace blancs",
					"length_exceeded": "Le courriel ne peut contenir plus de 50 caractères",
					"invalid": "Veuillez saisir un courriel dont le format est valide"
				},
				"password": {
					"not_equal": "Les mots de passes ne sont pas identiques",
					"is_null": "Le mot de passe ne peut être vide",
					"empty_or_white_spaces": "Le mot de passe doit comprendre entre 6 et 12 caractères ayant au moins 1 majuscule, 1 chiffre et 1 des symboles suivants : #?!{'@'}$%^&*-",
					"length": "Le mot de passe doit contenir entre 6 et 12 caractères",
					"no_number": "Le mot de passe doit comprendre au moins 1 chiffre",
					"no_symbol": "Le mot de passe doit comprendre au moins 1 des symboles suivants : '#?!{'@'}$%^&*-'",
					"no_uppercase_letter": "Le mot de passe doit comprendre au moins 1 majuscule",
					"invalid": "Le mot de passe est invalide. Il doit comprendre 1 majuscule, 1 chiffre et 1 des symboles suivants : '#?!{'@'}$%^&*-'"
				},
				"invalid": "Le courriel ou le mot de passe saisi est invalide"
			},
			"place": {
				"not_found": "La place est introuvable !",
				"title": {
					"already_taken": "Le titre du lieu saisi est déjà associé à une autre place",
					"is_null": "Le titre du lieu ne peut être vide",
					"empty_or_white_spaces": "Le titre du lieu ne peut être vide ou composé uniquement d'espaces blancs",
					"length": "Le titre du lieu doit contenir entre 3 et 50 caractères"
				},
				"description": {
					"is_null": "La description du lieu ne peut être vide",
					"empty_or_white_spaces": "La description du lieu ne peut être vide ou composé uniquement d'espaces blancs",
					"length": "La description du lieu doit contenir entre 3 et 500 caractères"
				},
				"steps": {
					"is_null": "Le champ pour les directives pour se rendre au lieu ne peut être vide",
					"empty_or_white_spaces": "Le champ pour les directives pour se rendre au lieu ne peut être vide ou composé uniquement d'espaces blancs",
					"length": "Les directives pour se rendre au lieu doit contenir entre 3 et 500 caractères"
				},
				"latitude": {
					"is_null": "La latitude ne peut être vide",
					"empty_or_white_spaces": "La latitude ne peut être vide ou composée uniquement d'espaces blancs",
					"range": "La latitude doit être entre -90 et 90"
				},
				"longitude": {
					"is_null": "La longitude ne peut être vide",
					"empty_or_white_spaces": "La longitude ne peut être vide ou composée uniquement d'espaces blancs",
					"range": "La longitude doit être entre -180 et 180"
				}
			},
			"climb": {
				"not_found": "La grimpe est introuvable !",
				"title": {
					"already_taken": "Le titre de la grimpe saisi est déjà associé à une autre grimpe pour un même lieu",
					"is_null": "Le titre de la grimpe ne peut être vide",
					"empty_or_white_spaces": "Le titre de la grimpe ne peut être vide ou composé uniquement d'espaces blancs",
					"length": "Le titre de la grimpe doit contenir entre 3 et 50 caractères"
				},
				"description": {
					"is_null": "La description de la grimpe ne peut être vide",
					"empty_or_white_spaces": "La description de la grimpe ne peut être vide ou composé uniquement d'espaces blancs",
					"length": "La description de la grimpe doit contenir entre 3 et 500 caractères"
				},
				"style": {
					"is_null": "Veuillez sélectionner une des valeurs dans le champs associé au style de la grimpe",
					"empty_or_white_spaces": "Veuillez sélectionner une des valeurs dans le champs associé au style de la grimpe",
					"not_in": "Veuillez sélectionner une des valeurs dans le champs associé au style de la grimpe"
				},
				"difficulty_level": {
					"not_decimal": "Le niveau de difficulté doit être une valeur numérique",
					"empty_or_white_spaces": "Le niveau de difficulté de la grimpe ne peut être vide ou composé uniquement d'espaces blancs",
					"range": "Le niveau de difficulté doit être entre 5.6 et 5.15",
					"min": "Le niveau de difficulté minimum à filtrer doit être inférieur au niveau maximum",
					"max": "Le niveau de difficulté maximum à filtrer doit être supérieur au niveau minimum"
				},
				"place_title": {
					"is_null": "La place associée  longitude ne peut être vide",
					"empty_or_white_spaces": "Veuillez sélectionner un lieu"
				},
				"images": {
					"is_null": "L'image pour la grimpe ne peut être vide",
					"empty_or_white_spaces": "L'image pour la grimpe ne peut être vide ou composée uniquement d'espaces blancs",
					"range": "Il vous faut sélectionner au moins une image pour la grimpe",
					"invalid": "Le format de l'image sélectionné est invalide. Le format accepté est : .jpg",
					"exists_already": "L'image sélectionnée est déjà une image sélectionnée pour la grimpe",
					"size": "La taille de l'image sélectionnée est trop grande. Veuillez choisir un fichier avant moins de 30ko",
					"which_one": "L'images ou les images sélectionnées en erreur est ou sont :"
				},
				"rate": {
					"range": {
						"min": "La note minimum doit être inférieure à la note maximum",
						"max": "La note maximum doit être supérieure à la note minimum"
					},
					"not_integer": "La note des grimpes à filtrer doit être un chiffre"
				}
			}
		},
		"routes": {
			"register": "Une erreur s'est produite à la création de votre compte utilisateur. Veuillez réessayer plus tard",
			"login": "Une erreur s'est produite lors de la connexion à votre compte utilisateur",
			"home": "Une erreur s'est produite au chargement de la page. Veuillez réessayer plus tard",
			"get": {
				"create": {
					"place": "Une erreur s'est produite lors de l'obtention du formulaire pour créer un lieu. Veuillez réessayer plus tard",
					"climb": "Une erreur s'est produite lors de l'obtention du formulaire pour créer une grimpe. Veuillez réessayer plus tard"
				},
				"update": {
					"place": "Une erreur s'est produite lors de l'obtention du formulaire pour modifier un lieu. Veuillez réessayer plus tard",
					"climb": "Une erreur s'est produite lors de l'obtention du formulaire pour modifier une grimpe. Veuillez réessayer plus tard"
				},
				"all": {
					"climbs": "Une erreur s'est produite à l'obtention des grimpes"
				}
			},
			"create": {
				"place": "Une erreur s'est produite. Il n'a pas été possible de créer le lieu",
				"climb": "Une erreur s'est produite. Il n'a pas été possible de créer la grimpe"
			},
			"update": {
				"place": "Une erreur s'est produite. Il n'a pas été possible d'enregistrer les modifications pour le présent lieu",
				"climb": "Une erreur s'est produite. Il n'a pas été possible d'enregistrer les modifications pour la présente grimpe",
				"account_profile": "Une erreur s'est produite. Il n'a pas été possible d'enregistrer les modifications à votre profil utilisateur"
			},
			"delete": {
				"place": "Une erreur s'est produite. Il n'a pas été possible de supprimer le lieu",
				"climb": "Une erreur s'est produite. Il n'a pas été possible de supprimer la grimpe"
			},
			"rate": {
				"climb": "Une erreur s'est produite en lien avec votre note. Veuillez réessayer plus tard"
			}
		}
	},
	"climb_style": {
		"traditional": "Traditionnelle",
		"sport": "Sportive",
		"top_roping": "Moulinette"
	},
	"display_text": {
		"rate": {
			"rate": "Note",
			"votes": "votes"
		},
		"min": "Min.",
		"max": "Max.",
		"style": "Style",
		"difficulty_level": "Niveau de difficulté",
		"place_title": "Lieu",
		"climb_title": "Grimpe",
		"welcome": "Bienvenue"
	}
}